app/Controllers/Clientes.php

SELECT *
FROM `registros`
WHERE `estado` = 1
SELECT *
FROM `clientes`
WHERE `cl_estado` = 1
---
    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();

        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers) && !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '.base64_encode($value['cliente_id'].':'.$value['llave_secreta'])){
                    $model = new ClientesModel();
                    $cliente = $model->where('cl_estado',1)->findAll();