app/Controllers/Empresa.php

SELECT *
FROM `registros`
WHERE `estado` = 1
SELECT *
FROM `empresa`
WHERE `em_estado` = 1
---
    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();

        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers) && !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '.base64_encode($value['cliente_id'].':'.$value['llave_secreta'])){
                    $model = new EmpresaModel();
                    $Empresa = $model->where('em_estado',1)->findAll();

SELECT *
FROM `registros`
WHERE `estado` = 1
---
    public function create(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();

SELECT *
FROM `registros`
WHERE `estado` = 1
---
    public function update($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $registro = $model->where('estado', 1)->findAll();
        foreach($registro as $key=>$value){
            if(array_key_exists('Authorization',$headers) && !empty($headers['Authorization'])){
                if($request->getHeader('Authorization')=='Authorization: Basic '.base64_encode($value['cliente_id'].':'.$value['llave_secreta'])){

                        $datos = $this->request->getRawInput();
                        if(!empty($datos)){
                            $validation->setRules([
                                "em_direccion" => 'required|string|max_length[255]',
                                "em_razonsocial" => 'required|string|max_length[255]',
                                "em_ruc" => 'required|integer',
                                "em_dueñonombre" => 'required|string|max_length[255]',
                                "em_dueñoapellido" => 'required|string|max_length[255]',
                                "em_telefono" => 'required|string|max_length[255]',
                                "em_logo" => 'required|string|max_length[255]'
                            ]);
                            $validation->withRequest($this->request)->run();
                            if($validation->getErrors()){
                                $errors = $validation->getErrors();
                                $data = array("Status"=>404, "Detalle"=>$errors);
                                return json_encode($data, true);
                            }
                            else{
                                $model = new EmpresaModel();
                                $Empresa = $model->find($id);