app/Models/DetalleVentasModel.php

    public function getDetalleVentas(){
        return $this->db->table('detalle_ventas dv')
        ->where('dv.dv_estado',1)
        ->join('ventas v','dv.ve_id = v.ve_id')
        ->join('productos pro','dv.pro_id = pro.pro_id')
        ->join('tipo_pago tp','dv.tp_id = tp.tp_id')
        ->join('clientes cl', 'cl.cl_id=v.cl_id')
        ->get()->getResultArray();
---
SELECT *
FROM `detalle_ventas` `dv`
JOIN `ventas` `v` ON `dv`.`ve_id` = `v`.`ve_id`
JOIN `productos` `pro` ON `dv`.`pro_id` = `pro`.`pro_id`
JOIN `tipo_pago` `tp` ON `dv`.`tp_id` = `tp`.`tp_id`
JOIN `clientes` `cl` ON `cl`.`cl_id`=`v`.`cl_id`
WHERE `dv`.`dv_estado` = 1