app/Models/PagosModel.php

    public function getPagos(){
        return $this->db->table('pagos p')
        ->where('p.pag_estado',1)
        ->join('proveedores pr','p.pv_id = pr.pv_id')
        ->join('stock s','p.st_id = s.st_id')
        ->join('productos pro','pro.pro_id = s.pro_id')
        ->get()->getResultArray();
---
SELECT *
FROM `pagos` `p`
JOIN `proveedores` `pr` ON `p`.`pv_id` = `pr`.`pv_id`
JOIN `stock` `s` ON `p`.`st_id` = `s`.`st_id`
JOIN `productos` `pro` ON `pro`.`pro_id` = `s`.`pro_id`
WHERE `p`.`pag_estado` = 1