app/Models/PedidosVentasModel.php

SELECT *
FROM `pedidos_ventas` `pev`
JOIN `ventas` `v` ON `pev`.`ve_id` = `v`.`ve_id`
JOIN `pedidos` `pe` ON `pev`.`pe_id` = `pe`.`pe_id`
JOIN `tipo_pago` `tp` ON `pev`.`tp_id` = `tp`.`tp_id`
WHERE `pev`.`pev_estado` = 1
---
    public function getPedidosVentas(){
        return $this->db->table('pedidos_ventas pev')
        ->where('pev.pev_estado',1)
        ->join('ventas v','pev.ve_id = v.ve_id')
        ->join('pedidos pe','pev.pe_id = pe.pe_id')
        ->join('tipo_pago tp','pev.tp_id = tp.tp_id')
        ->get()->getResultArray();