app/Models/PedidosModel.php

SELECT *
FROM `pedidos` `pe`
JOIN `clientes` `cl` ON `cl`.`id` = `pe`.`cl_id`
JOIN `productos` `pro` ON `pro`.`pro_id` = `pe`.`pro_id`
WHERE `pe`.`pe_estado` = 1
---
    public function getPedidos(){
        return $this->db->table('pedidos pe')
        ->where('pe.pe_estado',1)
        ->join('clientes cl','cl.cl_id = pe.cl_id')
        ->join('productos pro','pro.pro_id = pe.pro_id')
        ->get()->getResultArray();