app/Models/ProductosModel.php

SELECT *
FROM `productos` `pro`
JOIN `tipos_productos` `tpro` ON `pro`.`tpro_id` = `tpro`.`tpro_id`
WHERE `pro`.`pro_estado` = 1
---
    public function getProductos(){
        return $this->db->table('productos pro')
        ->where('pro.pro_estado',1)
        ->join('tipos_productos tpro','pro.tpro_id = tpro.tpro_id')
        ->get()->getResultArray();

SELECT *
FROM `productos` `pro`
JOIN `tipos_productos` `tpro` ON `pro`.`tpro_id` = `tpro`.`tpro_id`
WHERE `pro`.`pro_id` = '2'
AND `pro`.`pro_estado` = 1
---
    public function getId($id){
        return $this->db->table('productos pro')
        ->where('pro.pro_id', $id)
        ->where('pro.pro_estado', 1)
        ->join('tipos_productos tpro','pro.tpro_id = tpro.tpro_id')
        ->get()->getResultArray();