app/Models/PromocionesModel.php

    public function getPromociones(){
        return $this->db->table('promociones promo')
        ->where('promo.promo__estado',1)
        ->join('tipo_promociones tpromo','promo.tpromo_id = tpromo.tpromo_id')
        ->join('productos pro','pro.pro_id = promo.pro_id')
        ->get()->getResultArray();
---
SELECT *
FROM `promociones` `promo`
JOIN `tipo_promociones` `tpromo` ON `promo`.`tpromo_id` = `tpromo`.`tpromo_id`
JOIN `productos` `pro` ON `pro`.`pro_id` = `promo`.`pro_id`
WHERE `promo`.`promo__estado` = 1