app/Models/ResenasModel.php

SELECT *
FROM `resenas` `re`
JOIN `productos` `pro` ON `pro`.`pro_id` = `re`.`pro_id`
JOIN `usuariosmovil` `usumo` ON `usumo`.`usumo_id` = `re`.`usumo_id`
WHERE `re`.`re_estado` = 1
---
    public function getResenas(){
        return $this->db->table('resenas re')
        ->where('re.re_estado',1)
        ->join('productos pro','pro.pro_id = re.pro_id')
        ->join('usuariosmovil usumo','usumo.usumo_id = re.usumo_id')
        ->get()->getResultArray();